# 4. У послідовності знайти друге за величиною значення. Списки чи будь-які інші колекції не використовувати.
from task3 import main 
a = (1, 2, 4 , 9 , 8)

b = main(a)
result = tuple(a[i] for i in range(len(a)) if i not in b)
# Тут я багато раз використовував цю конструкцію того заповнив її просто на памʼять,
# тут не говориться що програма зробила  це як найшвидше тому я зробив найшвидше для мене, 
# тому забрав 2 числа саме маленьке і саме велике, і знову знайшов їх, я використав функцію з
# попереднього завдання, а і так далі я там писав англійською мені там швидше було на компʼютері щоб он переключатися
n = main(result)
print(n)